Revit 2024 API
BuiltInFailures.GeometryFailures.SuccessToConvertLine Property
 Success to convert lines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SuccessToConvertLine { get; }
Visual Basic
Public Shared ReadOnly Property SuccessToConvertLine As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SuccessToConvertLine {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace